fustyles/Arduino/ESP32-CAM_Tensorflow.js/ESP32-CAM_coco-ssd_PeopleTracking/app_httpd_coco-ssd_PeopleTracking.cpp
                var midX = Math.round(x)+Math.round(width)/2;
                if (midX>(40+320/2)) {
                  if (midX>260)
                    angle1Value1+=350;
                  else
                    angle1Value1+=175;
                  if (angle1Value1 > 7650) angle1Value1 = 7650;
                  ifr.src = document.location.origin+'/control?var=servo1&val='+angle1Value1; 
                  console.log(angle1Value1);
                }
                else if (midX<(320/2)-40) {
                  if (midX<60)
                    angle1Value1-=350;
                  else
                    angle1Value1-=175;
                  if (angle1Value1 < 2050) angle1Value1 = 2050;
                  ifr.src = document.location.origin+'/control?var=servo1&val='+angle1Value1;  
                  console.log(angle1Value1);
                }
                  
                var midY = Math.round(y)+Math.round(height)/2;
                if (midY>(240/2+40)) {
                  if (midY>200)
                    angle1Value2-=300;
                  else
                    angle1Value2-=150;  
                  if (angle1Value2 < 2050) angle1Value2 = 2050;
                  ifr.src = document.location.origin+'/control?var=servo2&val='+angle1Value2; 
                  console.log(angle1Value1);
                }
                else if (midY<(240/2)-40) {
                  if (midY<40)
                    angle1Value2+=300;
                  else
                    angle1Value2+=150;   
                  if (angle1Value2 > 7650) angle1Value2 = 7650;
                  ifr.src = document.location.origin+'/control?var=servo2&val='+angle1Value2;  
                  console.log(angle1Value1);
                }              
              }
              catch(e){}
            }  
          }
        }
        else
          result.innerHTML = "Unrecognizable";
        getStill.click();
      });   
    }
    ShowImage.onload = function (event) {
      if (Model) {
        try { 
          document.createEvent("TouchEvent");
          setTimeout(function(){DetectImage();},250);
        }
        catch(e) { 
          DetectImage();
        } 
      }
    }
    window.onload = function () { ObjectDetect(); }
    </script>
    </body>
</html>
)rawliteral";

static esp_err_t index_handler(httpd_req_t *req){
    httpd_resp_set_type(req, "text/html");
    //httpd_resp_set_hdr(req, "Content-Encoding", "gzip");
    //return httpd_resp_send(req, (const char *)index_html_gz, index_html_gz_len);
    return httpd_resp_send(req, (const char *)INDEX_HTML, strlen(INDEX_HTML));
}

void startCameraServer(){
    httpd_config_t config = HTTPD_DEFAULT_CONFIG();

    httpd_uri_t index_uri = {
        .uri       = "/",
        .method    = HTTP_GET,
        .handler   = index_handler,
        .user_ctx  = NULL
    };

    httpd_uri_t status_uri = {
        .uri       = "/status",
        .method    = HTTP_GET,
        .handler   = status_handler,
        .user_ctx  = NULL
    };

    httpd_uri_t cmd_uri = {
        .uri       = "/control",
        .method    = HTTP_GET,
        .handler   = cmd_handler,
        .user_ctx  = NULL
    };

    httpd_uri_t capture_uri = {
        .uri       = "/capture",
        .method    = HTTP_GET,
        .handler   = capture_handler,
        .user_ctx  = NULL
    };

   httpd_uri_t stream_uri = {
        .uri       = "/stream",
        .method    = HTTP_GET,
        .handler   = stream_handler,
        .user_ctx  = NULL
    };


    ra_filter_init(&ra_filter, 20);
    
    mtmn_config.min_face = 80;
    mtmn_config.pyramid = 0.7;
    mtmn_config.p_threshold.score = 0.6;
    mtmn_config.p_threshold.nms = 0.7;
    mtmn_config.r_threshold.score = 0.7;
    mtmn_config.r_threshold.nms = 0.7;
    mtmn_config.r_threshold.candidate_number = 4;
    mtmn_config.o_threshold.score = 0.7;
    mtmn_config.o_threshold.nms = 0.4;
    mtmn_config.o_threshold.candidate_number = 1;
    
    face_id_init(&id_list, FACE_ID_SAVE_NUMBER, ENROLL_CONFIRM_TIMES);
    
    Serial.printf("Starting web server on port: '%d'\n", config.server_port);
    if (httpd_start(&camera_httpd, &config) == ESP_OK) {
        httpd_register_uri_handler(camera_httpd, &index_uri);
        httpd_register_uri_handler(camera_httpd, &cmd_uri);
        httpd_register_uri_handler(camera_httpd, &status_uri);
        httpd_register_uri_handler(camera_httpd, &capture_uri);
    }

    config.server_port += 1;
    config.ctrl_port += 1;
    Serial.printf("Starting stream server on port: '%d'\n", config.server_port);
    if (httpd_start(&stream_httpd, &config) == ESP_OK) {
        httpd_register_uri_handler(stream_httpd, &stream_uri);
    }
}
